curl
zsh
git
cargo
ripgrep
gcc
dbus-x11
x11-apps
weston
upower
language-selector-common
language-pack-ja
ruby-full
build-essential
libssl-dev
zlib1g-dev
libbz2-dev
libreadline-dev
libsqlite3-dev
libncursesw5-dev
xz-utils
tk-dev
libxml2-dev
libxmlsec1-dev
libffi-dev
liblzma-dev
libportaudio2
pulseaudio